src/DataProcessors/кфкПанельАдминистрирования/кфкПанельАдминистрирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>кфкПанельАдминистрирования</name>
</mdclass:DataProcessor>

src/InformationRegisters/кфкПараметрыОчисткиХранилища/кфкПараметрыОчисткиХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкПараметрыОчисткиХранилища</name>
  <resources>
    <name>СрокХраненияОбработанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОтмененныхВходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОтмененныхИсходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОтправленных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОшибкиОбработкиВходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОшибкиОбработкиИсходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОшибкиОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияНезавершенных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/кфкПараметрыКонтроляИнтеграции/кфкПараметрыКонтроляИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкПараметрыКонтроляИнтеграции</name>
  <resources>
    <name>ВремяSLAВходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяSLAИсходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЧатаТГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТокенБотаТГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/DataProcessors/кфкПанельАдминистрирования/Forms/Очереди/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	кфкИспользоватьКонтрольИнтеграции.Значение КАК ИспользоватьКонтрольИнтеграции
		|ИЗ
		|	Константа.кфкИспользоватьКонтрольИнтеграции КАК кфкИспользоватьКонтрольИнтеграции";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ПрочитатьПараметрыОчисткиХранилища();
	ПрочитатьПараметрыКонтроляИнтеграции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ПараметрыОчисткиХранилища

&НаКлиенте
Процедура ПараметрыОчисткиХранилищаСрокХраненияНезавершенныхПриИзменении(Элемент)
	
	Если ПараметрыОчисткиХранилища.СрокХраненияНезавершенных = 0 Тогда
		ПараметрыОчисткиХранилища.СрокХраненияНезавершенных = ?(СрокХраненияНезавершенных > 0, -1, 1);
	КонецЕсли;
	
	ОбновитьПараметрыОчисткиХранилища();
	
	СрокХраненияНезавершенных = ПараметрыОчисткиХранилища.СрокХраненияНезавершенных;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОчисткиХранилищаСрокХраненияОбработанныхПриИзменении(Элемент)
	
	ОбновитьПараметрыОчисткиХранилища();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОчисткиХранилищаСрокХраненияОтмененныхВходящихПриИзменении(Элемент)
	
	ОбновитьПараметрыОчисткиХранилища();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОчисткиХранилищаСрокХраненияОтмененныхИсходящихПриИзменении(Элемент)
	
	ОбновитьПараметрыОчисткиХранилища();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОчисткиХранилищаСрокХраненияОтправленныхПриИзменении(Элемент)
	
	ОбновитьПараметрыОчисткиХранилища();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОчисткиХранилищаСрокХраненияОшибкиОбработкиВходящихПриИзменении(Элемент)
	
	ОбновитьПараметрыОчисткиХранилища();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОчисткиХранилищаСрокХраненияОшибкиОбработкиИсходящихПриИзменении(Элемент)
	
	ОбновитьПараметрыОчисткиХранилища();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОчисткиХранилищаСрокХраненияОшибкиОтправкиПриИзменении(Элемент)
	
	ОбновитьПараметрыОчисткиХранилища();
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыКонтроляИнтеграции

&НаКлиенте
Процедура ПараметрыКонтроляИнтеграцииИдентификаторЧатаТГПриИзменении(Элемент)
	
	ОбновитьПараметрыКонтроляИнтеграции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтроляИнтеграцииТокенБотаТГПриИзменении(Элемент)
	
	ОбновитьПараметрыКонтроляИнтеграции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтрольИнтеграцииВремяSLAВходящихПриИзменении(Элемент)
	
	ОбновитьПараметрыКонтроляИнтеграции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтрольИнтеграцииВремяSLAИсходящихПриИзменении(Элемент)
	
	ОбновитьПараметрыКонтроляИнтеграции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтроляИнтеграцииПериодSLAПриИзменении(Элемент)
	
	ОбновитьПараметрыКонтроляИнтеграции();
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Навигация

&НаКлиенте
Процедура ПерейтиОсновное(Команда)
	ВладелецФормы.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиФоновыеЗадания(Команда)
	ОткрытьСтраницу("ФоновыеЗадания");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиРегламентноеЗадание(Команда)
	ОткрытьСтраницу("РегламентноеЗадание");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиЛогирование(Команда)
	ОткрытьСтраницу("Логирование");
КонецПроцедуры

#КонецОбласти

#Область ПараметрыКонтроляИнтеграции

&НаКлиенте
Процедура ИспользоватьКонтрольИнтеграции(Команда)
	
	ИспользоватьКонтрольИнтеграции = Не ИспользоватьКонтрольИнтеграции;
	УстановитьИспользоватьКонтрольИнтеграции(ИспользоватьКонтрольИнтеграции);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	// НАВИГАЦИЯ
	Элементы.ПерейтиФоновыеЗадания.Картинка = ВладелецФормы.Элементы.ПерейтиФоновыеЗадания.Картинка;
	Элементы.ПерейтиРегламентноеЗадание.Картинка = ВладелецФормы.Элементы.ПерейтиРегламентноеЗадание.Картинка;
	
	// КОНТРОЛЬ ИНТЕГРАЦИИ
	Элементы.ГруппаКонтрольИнтеграции.Доступность = ЕстьИсторияХранилища();
	Элементы.ИспользоватьКонтрольИнтеграции.Пометка = ИспользоватьКонтрольИнтеграции;
	Элементы.ГруппаПараметрыКонтроляИнтеграции.Доступность = ИспользоватьКонтрольИнтеграции;
	
КонецПроцедуры

#Область Навигация

&НаКлиенте
Процедура ОткрытьСтраницу(ИмяСтраницы)
	
	ОткрытьФорму("Обработка.кфкПанельАдминистрирования.Форма." + ИмяСтраницы, , ВладелецФормы, , ВладелецФормы.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область Очереди

&НаКлиенте
Функция ЕстьИсторияХранилища()
	
	Возврат ПараметрыОчисткиХранилища.СрокХраненияОбработанных > 0
//		И ПараметрыОчисткиХранилища.СрокХраненияОтмененныхВходящих > 0
//		И ПараметрыОчисткиХранилища.СрокХраненияОтмененныхИсходящих > 0
		И ПараметрыОчисткиХранилища.СрокХраненияОтправленных > 0
		И ПараметрыОчисткиХранилища.СрокХраненияОшибкиОбработкиВходящих > 0
		И ПараметрыОчисткиХранилища.СрокХраненияОшибкиОбработкиИсходящих > 0
		И ПараметрыОчисткиХранилища.СрокХраненияОшибкиОтправки > 0;
			
КонецФункции

&НаКлиенте
Процедура ОбновитьПараметрыОчисткиХранилища()
	
	ПараметрыОчистки = Новый Структура;
	ПараметрыОчистки.Вставить("СрокХраненияНезавершенных", -1);
	// ИсходящиеСообщения
	ПараметрыОчистки.Вставить("СрокХраненияОшибкиОбработкиИсходящих", -1);
	ПараметрыОчистки.Вставить("СрокХраненияОтмененныхИсходящих", -1);
	ПараметрыОчистки.Вставить("СрокХраненияОшибкиОтправки", -1);
	ПараметрыОчистки.Вставить("СрокХраненияОтправленных", -1);
	// ВходящиеСообщения
	ПараметрыОчистки.Вставить("СрокХраненияОшибкиОбработкиВходящих", -1);
	ПараметрыОчистки.Вставить("СрокХраненияОтмененныхВходящих", -1);
	ПараметрыОчистки.Вставить("СрокХраненияОбработанных", -1);
	
	ЗаполнитьЗначенияСвойств(ПараметрыОчистки, ПараметрыОчисткиХранилища);
	
	ОбновитьПараметрыОчисткиХранилищаНаСервере(ПараметрыОчистки);
	
	Если Не ЕстьИсторияХранилища() И ИспользоватьКонтрольИнтеграции Тогда
		
		ИспользоватьКонтрольИнтеграции = Ложь;
		УстановитьИспользоватьКонтрольИнтеграции(Ложь);
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыКонтроляИнтеграции()
	
	ПараметрыКонтроля = Новый Структура;
	// Правила
	ПараметрыКонтроля.Вставить("ВремяSLAИсходящих", 10);
	ПараметрыКонтроля.Вставить("ВремяSLAВходящих", 10);
	// Настройки ТГ
	ПараметрыКонтроля.Вставить("ИдентификаторЧатаТГ", "");
	ПараметрыКонтроля.Вставить("ТокенБотаТГ", "");
	
	ЗаполнитьЗначенияСвойств(ПараметрыКонтроля, ПараметрыКонтроляИнтеграции);
	
	ОбновитьПараметрыКонтроляИнтеграцииНаСервере(ПараметрыКонтроля);
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьИспользоватьКонтрольИнтеграции(Знчаение)
	
	Константы.кфкИспользоватьКонтрольИнтеграции.Установить(Знчаение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьПараметрыОчисткиХранилищаНаСервере(НовыеПараметры)
	
	ПараметрыОчистки = РегистрыСведений.кфкПараметрыОчисткиХранилища.ПолучитьПараметры();
	ЗаполнитьЗначенияСвойств(ПараметрыОчистки, НовыеПараметры);
	РегистрыСведений.кфкПараметрыОчисткиХранилища.ОбновитьПараметры(ПараметрыОчистки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьПараметрыКонтроляИнтеграцииНаСервере(НовыеПараметры)
	
	РегистрыСведений.кфкПараметрыКонтроляИнтеграции.ОбновитьПараметры(НовыеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыОчисткиХранилища()
	
	ПараметрыОчистки = РегистрыСведений.кфкПараметрыОчисткиХранилища.ПолучитьПараметры();
	ЗаполнитьЗначенияСвойств(ПараметрыОчисткиХранилища, ПараметрыОчистки);
	
	СрокХраненияНезавершенных = ПараметрыОчисткиХранилища.СрокХраненияНезавершенных;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыКонтроляИнтеграции()
	
	ПараметрыКонтроля = РегистрыСведений.кфкПараметрыКонтроляИнтеграции.ПолучитьПараметры();
	ЗаполнитьЗначенияСвойств(ПараметрыКонтроляИнтеграции, ПараметрыКонтроля);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
